### Pandas
### Pandas dataframes and indexing

In [1]:
import pandas as pd
import numpy as np

In [4]:
sports1=pd.Series([1,2,3,4],index=['cricket','fball','bball','golf'])
sports1

cricket    1
fball      2
bball      3
golf       4
dtype: int64

In [5]:
sports1['golf']

4

In [6]:
sports2=pd.Series([1,2,3,4],index=['chess','ludo','carom','video games'])
sports2

chess          1
ludo           2
carom          3
video games    4
dtype: int64

In [7]:
sports1+sports2

bball         NaN
carom         NaN
chess         NaN
cricket       NaN
fball         NaN
golf          NaN
ludo          NaN
video games   NaN
dtype: float64

In [8]:
sports3=pd.Series([1,2,3,4],index=['cricket','fball','carom','ludo'])
sports1+sports2+sports3

bball         NaN
carom         NaN
chess         NaN
cricket       NaN
fball         NaN
golf          NaN
ludo          NaN
video games   NaN
dtype: float64

In [9]:
sports1+sports3

bball      NaN
carom      NaN
cricket    2.0
fball      4.0
golf       NaN
ludo       NaN
dtype: float64

In [10]:
df1=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='Score1 Score2 Score3 Score4 Score5'.split())
df1

     Score1    Score2    Score3    Score4    Score5
A  0.727729  0.488839  0.689385  0.510238  0.306387
B  0.626313  0.049558  0.431182  0.348823  0.695574
C  0.729800  0.691425  0.315588  0.127417  0.201819
D  0.428297  0.143026  0.185686  0.626542  0.661124
E  0.674000  0.106966  0.453612  0.572224  0.722197
F  0.358586  0.098137  0.219245  0.573539  0.186020
G  0.890420  0.380723  0.192746  0.954295  0.540601
H  0.367230  0.319288  0.831040  0.214026  0.605170

In [12]:
df1['Score1']

A    0.727729
B    0.626313
C    0.729800
D    0.428297
E    0.674000
F    0.358586
G    0.890420
H    0.367230
Name: Score1, dtype: float64

In [16]:
df1[['Score1','Score2','Score3']]

     Score1    Score2    Score3
A  0.727729  0.488839  0.689385
B  0.626313  0.049558  0.431182
C  0.729800  0.691425  0.315588
D  0.428297  0.143026  0.185686
E  0.674000  0.106966  0.453612
F  0.358586  0.098137  0.219245
G  0.890420  0.380723  0.192746
H  0.367230  0.319288  0.831040

In [17]:
df1['Score6']=df1['Score1']+df1['Score2']
df1

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.727729  0.488839  0.689385  0.510238  0.306387  1.216568
B  0.626313  0.049558  0.431182  0.348823  0.695574  0.675871
C  0.729800  0.691425  0.315588  0.127417  0.201819  1.421224
D  0.428297  0.143026  0.185686  0.626542  0.661124  0.571323
E  0.674000  0.106966  0.453612  0.572224  0.722197  0.780966
F  0.358586  0.098137  0.219245  0.573539  0.186020  0.456723
G  0.890420  0.380723  0.192746  0.954295  0.540601  1.271143
H  0.367230  0.319288  0.831040  0.214026  0.605170  0.686517

In [18]:
df2={'ID':['101','102','103','104','105'],'Name':["Laxmi","Akansha","Ayush","Sachin","Mahek"],'Profit':[20,34,56,78,90]}
df=pd.DataFrame(df2)
df

    ID     Name  Profit
0  101    Laxmi      20
1  102  Akansha      34
2  103    Ayush      56
3  104   Sachin      78
4  105    Mahek      90

In [19]:
df["ID"]

0    101
1    102
2    103
3    104
4    105
Name: ID, dtype: object

In [20]:
df[["ID","Name"]]

    ID     Name
0  101    Laxmi
1  102  Akansha
2  103    Ayush
3  104   Sachin
4  105    Mahek

In [24]:
df.drop(3)

      Name  Profit
0    Laxmi      20
1  Akansha      34
2    Ayush      56
4    Mahek      90

In [29]:
df.drop(1)

     Name  Profit
0   Laxmi      20
2   Ayush      56
3  Sachin      78
4   Mahek      90